# GetLocus3D

## Description
Procedure GetLocus3D returns the coordinates of the referenced 3D locus object.&lt;BR&gt;

```pascal
PROCEDURE GetLocus3D(
				h     : HANDLE;
				VAR p : REAL);
```

```python

def vs.GetLocus3D(h):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to 3D locus.|
|p|REAL|Returns 3D coordinates of locus.|

## Version
Availability: from MiniCAD6.0
## Category
* Objects - 3D